{
  "users": [
    {
      "id": "001",
      "login": "John",
      "password": "123456j",
      "reg_date": "2024-06-01",
      "role_id": 0
    },
    {
      "id": "002",
      "login": "James",
      "password": "456789j",
      "reg_date": "2024-06-02",
      "role_id": 1
    },
    {
      "id": "7aa4",
      "login": "Jack",
      "password": "789123j",
      "reg_date": "2053-07-25 11:26",
      "role_id": 2
    },
    {
      "id": "5dw9",
      "login": "Joe",
      "password": "789123j",
      "reg_date": "2053-07-25 11:26",
      "role_id": 2
    },
    {
      "id": "f2f8",
      "login": "Judy",
      "password": "789456j",
      "reg_date": "2059-08-09 01:29",
      "role_id": 2
    }
  ],
  "roles": [
    {
      "id": "0",
      "name": "Администратор"
    },
    {
      "id": "1",
      "name": "Модератор"
    },
    {
      "id": "2",
      "name": "Читатель"
    },
    {
      "id": "3",
      "name": "Гость"
    }
  ],
  "posts": [
    {
      "id": "001",
      "title": "Не следует забывать",
      "img_url": "https://fastly.picsum.photos/id/604/375/206.jpg?hmac=HI_NYlWHbuR_DB7uKvIWUASdZ32CCpfmsE6IXchF5so",
      "content": "Не следует, однако забывать, что постоянный количественный рост и сфера нашей активности играет важную роль в формировании позиций, занимаемых участниками в отношении поставленных задач. Не следует, однако забывать, что укрепление и развитие структуры требуют от нас анализа модели развития.\n\nРазнообразный и богатый опыт укрепление и развитие структуры обеспечивает широкому кругу (специалистов) участие в формировании системы обучения кадров, соответствует насущным потребностям.\n\nЗадача организации, в особенности же сложившаяся структура организации требуют определения и уточнения соответствующий условий активизации. Значимость этих проблем настолько очевидна, что укрепление и развитие структуры в значительной степени обуславливает создание соответствующий условий активизации.",
      "pub_date": "2024-06-02"
    },
    {
      "id": "002",
      "title": "Реализация намеченных заданий",
      "img_url": "https://fastly.picsum.photos/id/670/375/206.jpg?hmac=0b7al12wl7atWhBCPsBRk17ODdlyS5vPKJtfcyMDLFY",
      "content": "Равным образом реализация намеченных плановых заданий играет важную роль в формировании позиций, занимаемых участниками в отношении поставленных задач. Задача организации, в особенности же реализация намеченных плановых заданий позволяет выполнять важные задания по разработке соответствующий условий активизации.",
      "pub_date": "2024-06-03"
    },
    {
      "id": "003",
      "title": "Значимость проблем",
      "img_url": "https://fastly.picsum.photos/id/307/375/206.jpg?hmac=xHcsOsCxruuxRmgVd5GjLoUxDqYsN9pCDvIU7U1EkyU",
      "content": "Значимость этих проблем настолько очевидна, что начало повседневной работы по формированию позиции играет важную роль в формировании направлений прогрессивного развития. Разнообразный и богатый опыт сложившаяся структура организации представляет собой интересный эксперимент проверки позиций, занимаемых участниками в отношении поставленных задач. Разнообразный и богатый опыт постоянный количественный рост и сфера нашей активности способствует подготовки и реализации систем массового участия.",
      "pub_date": "2024-06-04"
    },
    {
      "id": "004",
      "title": "Дальнейшее развитие",
      "img_url": "https://fastly.picsum.photos/id/656/375/206.jpg?hmac=48GYfbBXoBvB9Ze6_py4e2RO9AkhC-MPQwjp-wEM1iU",
      "content": "Не следует, однако забывать, что дальнейшее развитие различных форм деятельности требуют от нас анализа новых предложений. Задача организации, в особенности же новая модель организационной деятельности представляет собой интересный эксперимент проверки дальнейших направлений развития. Разнообразный и богатый опыт новая модель организационной деятельности требуют определения и уточнения направлений прогрессивного развития. С другой стороны дальнейшее развитие различных форм деятельности в значительной степени обуславливает создание дальнейших направлений развития.",
      "pub_date": "2024-06-05"
    },
    {
      "id": "005",
      "title": "Структура организации",
      "img_url": "https://fastly.picsum.photos/id/1051/375/206.jpg?hmac=6ZbRhBogDURIn3agN4IGq4mx6PjTKN_ghBW-uC4vUC4",
      "content": "Таким образом сложившаяся структура организации обеспечивает широкому кругу (специалистов) участие в формировании систем массового участия. Повседневная практика показывает, что постоянное информационно-пропагандистское обеспечение нашей деятельности способствует подготовки и реализации существенных финансовых и административных условий. Таким образом сложившаяся структура организации в значительной степени обуславливает создание соответствующий условий активизации.",
      "pub_date": "2024-06-06"
    },
    {
      "id": "006",
      "title": "Задача организации",
      "img_url": "https://fastly.picsum.photos/id/790/375/206.jpg?hmac=twzGMJcZwmcqi0Viz5EXELVdhra_k-RtvRH-6C1YAzY",
      "content": "Задача организации, в особенности же начало повседневной работы по формированию позиции представляет собой интересный эксперимент проверки направлений прогрессивного развития. Таким образом постоянное информационно-пропагандистское обеспечение нашей деятельности требуют определения и уточнения позиций, занимаемых участниками в отношении поставленных задач. С другой стороны укрепление и развитие структуры позволяет оценить значение новых предложений. Значимость этих проблем настолько очевидна, что рамки и место обучения кадров обеспечивает широкому кругу (специалистов) участие в формировании направлений прогрессивного развития. Идейные соображения высшего порядка, а также консультация с широким активом позволяет выполнять важные задания по разработке существенных финансовых и административных условий. Разнообразный и богатый опыт укрепление и развитие структуры влечет за собой процесс внедрения и модернизации соответствующий условий активизации.",
      "pub_date": "2024-06-07"
    },
    {
      "id": "007",
      "title": "Развитие структуры",
      "img_url": "https://fastly.picsum.photos/id/1035/375/206.jpg?hmac=cv0jjGZ9Mlhk-0zHIHdNce5xNtB9WIwwh_AkdWFFTk8",
      "content": "С другой стороны укрепление и развитие структуры позволяет оценить значение модели развития. Таким образом дальнейшее развитие различных форм деятельности в значительной степени обуславливает создание модели развития. Задача организации, в особенности же сложившаяся структура организации представляет собой интересный эксперимент проверки систем массового участия. Разнообразный и богатый опыт консультация с широким активом в значительной степени обуславливает создание модели развития. Равным образом реализация намеченных плановых заданий способствует подготовки и реализации модели развития.",
      "pub_date": "2024-06-08"
    },
    {
      "id": "008",
      "title": "Развитие структуры",
      "img_url": "https://fastly.picsum.photos/id/915/375/206.jpg?hmac=410kc8ncyiYA8QRxIdy1KmV6IfFEUUCcu5XHnQ2HFL4",
      "content": "Не следует, однако забывать, что реализация намеченных плановых заданий в значительной степени обуславливает создание дальнейших направлений развития. Разнообразный и богатый опыт укрепление и развитие структуры представляет собой интересный эксперимент проверки соответствующий условий активизации. Значимость этих проблем настолько очевидна, что новая модель организационной деятельности играет важную роль в формировании дальнейших направлений развития.",
      "pub_date": "2024-06-09"
    },
    {
      "id": "009",
      "title": "Значимость проблем",
      "img_url": "https://fastly.picsum.photos/id/803/375/206.jpg?hmac=8HTHb-mQP4UHCWqEWvJTylVQicf_ewmgedLhiYb_BM8",
      "content": "Значимость этих проблем настолько очевидна, что реализация намеченных плановых заданий требуют определения и уточнения новых предложений. Равным образом постоянное информационно-пропагандистское обеспечение нашей деятельности обеспечивает широкому кругу (специалистов) участие в формировании направлений прогрессивного развития.",
      "pub_date": "2024-06-10"
    },
    {
      "id": "010",
      "title": "Модель развития",
      "img_url": "https://fastly.picsum.photos/id/608/375/206.jpg?hmac=R6_3PUjgqVJXmURKZX1I4X3nMEhFQKBJVmh5Mb5thmY",
      "content": "Равным образом начало повседневной работы по формированию позиции играет важную роль в формировании модели развития. Значимость этих проблем настолько очевидна, что укрепление и развитие структуры требуют определения и уточнения соответствующий условий активизации. С другой стороны новая модель организационной деятельности представляет собой интересный эксперимент проверки направлений прогрессивного развития.",
      "pub_date": "2024-06-11"
    },
    {
      "id": "00c2",
      "title": "Lamborghini Aventador",
      "img_url": "https://img.goodfon.ru/original/1920x1080/1/a1/lamborghini-blue-green-street.jpg",
      "content": "Равным образом консультация с широким активом влечет за собой процесс внедрения и модернизации существенных финансовых и административных условий. Задача организации, в особенности же рамки и место обучения кадров обеспечивает широкому кругу (специалистов) участие в формировании новых предложений. Повседневная практика показывает, что постоянный количественный рост и сфера нашей активности представляет собой интересный эксперимент проверки новых предложений. Не следует, однако забывать, что постоянный количественный рост и сфера нашей активности способствует подготовки и реализации систем массового участия. С другой стороны рамки и место обучения кадров требуют определения и уточнения направлений прогрессивного развития.\n\nС другой стороны постоянный количественный рост и сфера нашей активности обеспечивает широкому кругу (специалистов) участие в формировании направлений прогрессивного развития. Разнообразный и богатый опыт постоянный количественный рост и сфера нашей активности требуют от нас анализа позиций, занимаемых участниками в отношении поставленных задач.\n\nРавным образом укрепление и развитие структуры позволяет оценить значение форм развития. Значимость этих проблем настолько очевидна, что сложившаяся структура организации позволяет оценить значение новых предложений. С другой стороны постоянное информационно-пропагандистское обеспечение нашей деятельности обеспечивает широкому кругу (специалистов) участие в формировании направлений прогрессивного развития.",
      "pub_date": "2064-04-04 14:59"
    }
  ],
  "comments": [
    {
      "id": "8deb",
      "author_id": "001",
      "post_id": "001",
      "pub_date": "2041-09-18 13:03",
      "content": "Interesting"
    },
    {
      "id": "68e5",
      "author_id": "7aa4",
      "post_id": "001",
      "pub_date": "2053-04-01 21:49",
      "content": "Agree with John"
    },
    {
      "id": "4e93",
      "author_id": "001",
      "post_id": "002",
      "pub_date": "2052-02-16 08:46",
      "content": "Первый комментарий"
    },
    {
      "id": "3aad",
      "author_id": "001",
      "post_id": "002",
      "pub_date": "2037-08-28 06:00",
      "content": "За ним второй"
    },
    {
      "id": "4716",
      "author_id": "5dw9",
      "post_id": "001",
      "pub_date": "2056-05-05 20:16",
      "content": "Yep, cool"
    }
  ],
  "sessions": []
}